In [1]:
import pandas as pb

In [6]:
df = pb.DataFrame({'nome':['Rafael','Maria','Joao'],'idade':[10,30,20]})
df

     nome  idade
0  Rafael     10
1   Maria     30
2    Joao     20

In [7]:
df.loc[0,'nome'] = 'Rafael2'
df

      nome  idade
0  Rafael2     10
1    Maria     30
2     Joao     20

In [8]:
df['sexo'] = ['M','F','M']
df

      nome  idade sexo
0  Rafael2     10    M
1    Maria     30    F
2     Joao     20    M

In [9]:
df = df.append({'nome':'Ana','idade':15,'sexo':'F'},ignore_index = True)
df

      nome  idade sexo
0  Rafael2     10    M
1    Maria     30    F
2     Joao     20    M
3      Ana     15    F

In [10]:
df = df.append({'nome':['Ana, Tereza'],'idade':15,'sexo':'F'},ignore_index = True)
df

            nome  idade sexo
0        Rafael2     10    M
1          Maria     30    F
2           Joao     20    M
3            Ana     15    F
4  [Ana, Tereza]     15    F